I did follow those steps and I can even create new groups and manage members with the Apply ;)
My issue is with the import action only.

Part of the plan output:
```
  # module.team_myteam.gsuite_group.team will be created
  + resource "gsuite_group" "team" {
      + admin_created        = (known after apply)
      + direct_members_count = (known after apply)
      + email                = "myteam@my-company.com.br"
      + id                   = (known after apply)
      + name                 = "My Team"
      + non_editable_aliases = (known after apply)
    }
```

I only got the plan to work after fully configuring the credential file.